{
    "version": "https://jsonfeed.org/version/1",
    "title": "Surrey Dental Implants",
    "description": "",
    "home_page_url": "https://automaniacmrk.github.io/SurreyDentalImplants",
    "feed_url": "https://automaniacmrk.github.io/SurreyDentalImplants/feed.json",
    "user_comment": "",
    "author": {
        "name": "Dentist"
    },
    "items": [
        {
            "id": "https://automaniacmrk.github.io/SurreyDentalImplants/surrey-dental-implant-specialists.html",
            "url": "https://automaniacmrk.github.io/SurreyDentalImplants/surrey-dental-implant-specialists.html",
            "title": "Surrey Dental Implant Specialists",
            "summary": "Surrey Dental Implant Specialists Angel Care Dental is your Surrey dental implant specialist. We are ready to assist you in achieving your dental goals. We offer a permanent solution for an incomplete smile. Dental implants are a permanent solution for those who have lost their&hellip;",
            "content_html": "<h2>Surrey Dental Implant Specialists</h2>\n<p>Angel Care Dental is your<a href=\"https://www.angelcaredental.com/service/dental-implants/\"> Surrey dental implant specialist</a>. We are ready to assist you in achieving your dental goals. We offer a permanent solution for an incomplete smile. Dental implants are a permanent solution for those who have lost their tooth due to injury, disease or accident.</p>\n<p><img loading=\"lazy\" src=\"https://semiahmoodental.b-cdn.net/wp-content/uploads/2016/12/DentalImplant.jpg\" data-is-external-image=\"true\"  alt=\"Surrey Dental Implants\" data-cke-saved-src=\" https://semiahmoodental.b-cdn.net/wp-content/uploads/2016/12/DentalImplant.jpg\"></p>\n<h2>Are You a Candidate for Dental Implant Treatments?</h2>\n<p>Adults of all ages are eligible for dental implants provided they are in good physical condition and their gums are healthy. We always carry out a thorough consultation first to determine if it is safe to go ahead with the treatment.</p>\n<h2>What is the cost of All-On-4 dental implants?</h2>\n<p>As with all dental procedures, many factors can impact the price of All-on-4 implants.</p>\n<p>Based on the information you provide, our team will give you a quotation. A consultation allows us to spend time with you so we can truly understand your oral health goals, as well as your financial considerations.</p>\n<p><img loading=\"lazy\" src=\"https://neoralfacial.com/wp-content/uploads/2021/10/s2.png\" data-is-external-image=\"true\"  alt=\"Surrey Dental Implants\" data-cke-saved-src=\" https://neoralfacial.com/wp-content/uploads/2021/10/s2.png\"></p>\n<h2>What Should I Do After Getting A Dental Implant?</h2>\n<p>After surgery, patients should take a break and not exert themselves. Patients should refrain from vigorously brushing or rinsing after surgery.</p>\n<h2>Why Are Some Practices Advertising Implants For Less Than The Price I Have Been Quoted?</h2>\n<p>The time we spend planning every case, and using the best surgical fixtures and components ensures that our high success rates and predictability. By cutting out the planning stages and purchasing replica systems, costs can reduce significantly, but this ultimately results in reduced predictability and long term success. The team at Angel Care Dental has spent many years refining their skills in implants and restorative dentistry and is still involved with post-graduate education and teaching.</p>",
            "author": {
                "name": "Dentist"
            },
            "tags": [
            ],
            "date_published": "2022-06-22T21:04:24-07:00",
            "date_modified": "2022-08-22T22:35:44-07:00"
        },
        {
            "id": "https://automaniacmrk.github.io/SurreyDentalImplants/what-is-a-dental-implant.html",
            "url": "https://automaniacmrk.github.io/SurreyDentalImplants/what-is-a-dental-implant.html",
            "title": "What is a Dental Implant?",
            "summary": "What is a Dental Implant? Dental implants are artificial screws made of titanium or zirconium oxide that connect the jawbone and a dental restoration like a crown or denture. They are also called 'endosseous' implants or fixtures. These implants are an artificial root for a&hellip;",
            "content_html": "<h2>What is a Dental Implant?</h2>\n<p>Dental implants are artificial screws made of titanium or zirconium oxide that connect the jawbone and a dental restoration like a crown or denture. They are also called 'endosseous' implants or fixtures. These implants are an artificial root for a tooth. Once implanted, the implant integrates with the surrounding bone like part of the body. When placing dental implants in an upper jaw, dental surgeons may perform bone grafting to fix the implant.</p>\n<p><img loading=\"lazy\" src=\"https://www.smilepad.co.uk/wp-content/uploads/2018/02/Mini-dental-Implant-732x310.jpg\" data-is-external-image=\"true\"  alt=\"Surrey Dental Implants\" data-cke-saved-src=\" https://www.smilepad.co.uk/wp-content/uploads/2018/02/Mini-dental-Implant-732x310.jpg\"></p>\n<h2>The Procedure</h2>\n<p>Usually, <a href=\"https://www.angelcaredental.com/service/dental-implants/\">dental implant surgery</a> can be performed in several stages. Sometimes, when the tooth has been damaged and is still in its place, the dentist may need to extract it at another stage.</p>\n<p>To begin, the gum is opened up to expose the bone. Then, each dental implant is carefully placed into a socket drilled at the precise location of the intended tooth. After the implant site is inserted, the gum tissue around it is closed. Often the dental implant can be placed at the same time as removal of the tooth, all on the same day.</p>\n<p>If a dental implant has a screw-thread on its outer surface it can be screwed into position and if it does not, it is usually tapped into place.</p>\n<p>When installing a dental implant, the main goal is to make contact immediately with surrounding bone. This provides stability and is maintained over time.</p>\n<p>In order to support replacement teeth, dental implants normally have some form of internal screw thread or post space that allows a variety of components to be fitted.</p>\n<p>Once fitted, these components provide the foundation for long-term support of crowns, bridges or dentures.</p>",
            "author": {
                "name": "Dentist"
            },
            "tags": [
            ],
            "date_published": "2022-06-22T21:02:41-07:00",
            "date_modified": "2022-07-04T19:52:30-07:00"
        },
        {
            "id": "https://automaniacmrk.github.io/SurreyDentalImplants/dental-implant-tooth-process.html",
            "url": "https://automaniacmrk.github.io/SurreyDentalImplants/dental-implant-tooth-process.html",
            "title": "Dental Implant Tooth Process",
            "summary": "Implants are an effective and long-lasting way to replace missing or damaged teeth. We'll help you decide if dental implants are right for you. Dental implant procedures are just one of the many dental services we offer our patients. If you have a damaged or&hellip;",
            "content_html": "<p><img loading=\"lazy\" src=\"https://d2l4d0j7rmjb0n.cloudfront.net/site/772/seo/image.svg\" data-is-external-image=\"true\"  alt=\"Surrey Dental Implants\" data-cke-saved-src=\" https://d2l4d0j7rmjb0n.cloudfront.net/site/772/seo/image.svg\"></p>\n<h2>Dental Implant Tooth Process</h2>\n<p>Implants are an effective and long-lasting way to replace missing or damaged teeth. We'll help you decide if dental implants are right for you.</p>\n<p><a href=\"https://www.angelcaredental.com/service/dental-implants/\">Dental implant procedures</a> are just one of the many dental services we offer our patients. If you have a damaged or lost tooth, you have dental options available to you. You may need to replace just one tooth, or perhaps you need to replace several. Dentures are a completely different process. Either way, your dentist will help you determine the best course of action.</p>\n<p>People can lose teeth in the following ways:</p>\n<ul>\n<li>Oral disease</li>\n<li>Teeth grinding</li>\n<li>Tooth decay</li>\n<li>Accidents</li>\n<li>Injury</li>\n</ul>\n<p>To find out if your teeth are suitable for dental implants, call our office and speak to one our experienced team members. Your dentist can arrange a consultation where he will evaluate your oral health and examine your teeth to decide if the procedure is for you.</p>\n<p>Here are some additional benefits of dental implants:</p>\n<ul>\n<li>Durability</li>\n<li>Maintenance low</li>\n<li>You will feel and look natural with your teeth</li>\n<li>Boost and restore your confidence</li>\n</ul>\n<p>Call us today if you believe dental implants might be the best option for you. We are passionate about the health of your smiles and your dental health.</p>",
            "author": {
                "name": "Dentist"
            },
            "tags": [
            ],
            "date_published": "2022-06-22T21:02:13-07:00",
            "date_modified": "2022-07-02T08:32:24-07:00"
        },
        {
            "id": "https://automaniacmrk.github.io/SurreyDentalImplants/why-dental-implants.html",
            "url": "https://automaniacmrk.github.io/SurreyDentalImplants/why-dental-implants.html",
            "title": "Why Dental Implants?",
            "summary": "Why Dental Implants? Implants are better than partial or bridge dentures. Why compromise the structure of surrounding healthy teeth to bridge a space? A partial denture can also be removed at night, or even after meals. This could cause food to trap between teeth. When&hellip;",
            "content_html": "<h1><img loading=\"lazy\" src=\"https://d2zp5xs5cp8zlg.cloudfront.net/image-19570-800.jpg\" data-is-external-image=\"true\"  alt=\"Surrey Dental Implants\" data-cke-saved-src=\" https://d2zp5xs5cp8zlg.cloudfront.net/image-19570-800.jpg\"></h1>\n<h2>Why Dental Implants?</h2>\n<p>Implants are better than partial or bridge dentures. Why compromise the structure of surrounding healthy teeth to bridge a space? A partial denture can also be removed at night, or even after meals. This could cause food to trap between teeth. When teeth are missing, the jawbone starts to deteriorate. However, dental implants stop the bone from melting away, providing a much more pleasing appearance and significant improvement in chewing function compared to an empty space.</p>\n<p>Implants can be used for a single tooth or multiple missing teeth, as well as the whole dental arch. If conventional dentures are not fitting well due to lack of jawbone, an implant-supported denture can be ideal in returning proper retention and function of your dentures.</p>\n<h2>How Does Dental Implant Restoration Work?</h2>\n<p>Dental implants are an artificial tooth that looks natural and is made from metal or porcelain. The implant consists of two parts: a titanium screw attached to the jawbone, and a tooth-coloured Crown. Dental implants can be used to replace missing teeth and are biocompatible. They fuse well with bone.</p>\n<p>Dental implants are not like dentures. They will stay in place and remain there. They do not interfere with speech. Implants are a permanent part of the mouth and can be used to alleviate pain. Furthermore, dental implants do not require the reduction of any of your remaining teeth. Implants look so much like natural teeth, that nobody will know you have had it unless they perform a dental examination.</p>\n<p><img loading=\"lazy\" src=\"https://surreydentalimplants.co.uk/wp-content/uploads/2022/04/dental-implant-before-after-dental-surrey.png\" data-is-external-image=\"true\"  alt=\"Surrey Dental Implants\" data-cke-saved-src=\" https://surreydentalimplants.co.uk/wp-content/uploads/2022/04/dental-implant-before-after-dental-surrey.png\"></p>\n<h2>Implant Surgery: Is it painful?</h2>\n<p>Although the process may sound daunting, <a href=\"https://www.angelcaredental.com/service/dental-implants/\">dental implant patients in Surrey</a> often find placement much better than anticipated. As with all dental treatments, you'll be conscious during the procedure and given local anesthesia. For more complex procedures, or at a patient's request, we can also provide conscious sedation, meaning a more comfortable experience for the patient.</p>\n<p>The surgery should be painless and you will not feel any discomfort.</p>\n<p>You will feel some discomfort after the procedure is completed. You will receive post-operative medication depending on what type of surgery you had and the specific needs of your health. This medication is designed to keep you pain-free as well as low-risk of infection.</p>\n<p>Implants may cause some discomfort if bone grafts were performed alongside them. However, it is still minimal.</p>\n<p>If you have any questions or worries before, during or after your treatment the team at Angel Care Dental are happy to help you.</p>\n<h2>What is the time it takes?</h2>\n<ul>\n<li>Examination</li>\n</ul>\n<ul>\n<li>Examining</li>\n</ul>\n<p>You will be subject to a comprehensive oral exam during your appointment. We will require a 3D X-ray called a Cone Beam Computed Tomography (CBCT) scan. It provides precise information about the amount of bone available as well as its proximity to any other important structures, like nerves or blood vessels. We wait six to twelve weeks for teeth that need to be extracted before we place an implant. However, there are some cases when the crown can be placed immediately.</p>\n<ul>\n<li>Surgical Procedure</li>\n</ul>\n<ul>\n<li>Surgical Procedure</li>\n</ul>\n<ul>\n<li>Recovery</li>\n</ul>\n<ul>\n<li>Recovery</li>\n</ul>\n<p>You may feel some discomfort after the anesthetic has worn off. You will be given specific instruction on what medication to take and how to look after the surgical site. The implant will begin to fuse and merge with the surrounding bone (osseo-integration). This process takes time depending on how well the patient heals and whether any bone grafting has been done. Integration can take as long as 3 months in simple cases, while it may take 9 months to integrate grafted cases.</p>\n<ul>\n<li>Installation of the crown</li>\n</ul>\n<ul>\n<li>Fitting of the implant crown</li>\n</ul>\n<p>Once the implant has fused with the bone you will pay your dentist another visit, at this point, your dentist will take an impression to fabricate a custom made porcelain crown. At the following appointment, the crown is then either screwed or cemented to the implant body, completing the restoration.</p>\n<p>At Angel Care Dental we have the latest facilities including specialised equipment such as microscopes and hard/soft tissue lasers. We only use the finest implant components made by the most respected manufacturers around the globe. There are over 250 different implant manufacturers with thousands of different implant designs. Many attempt to copy the designs of more successful and established implant companies. Noess and Nobel Biocare are our market leaders.</p>",
            "author": {
                "name": "Dentist"
            },
            "tags": [
            ],
            "date_published": "2022-06-22T20:59:47-07:00",
            "date_modified": "2022-07-04T08:51:03-07:00"
        },
        {
            "id": "https://automaniacmrk.github.io/SurreyDentalImplants/surrey-dental-implants.html",
            "url": "https://automaniacmrk.github.io/SurreyDentalImplants/surrey-dental-implants.html",
            "title": "Surrey Dental Implants",
            "summary": "Surrey Dental Implants The Procedure Dental implant surgery is usually performed in stages. Sometimes, the tooth may be damaged and still in its place. In these cases the dentist might need to extract it separately before proceeding with the implant process. First, open the gum&hellip;",
            "content_html": "<h1>Surrey Dental Implants</h1>\n<h2><img loading=\"lazy\" src=\"https://www.implantperiospecialist.com/files/2020/12/All-on-4-All-on-6-implants-Teeth-in-a-day-Full-Implant-Denture-IMPrESS-Perio-Implant-Center-Dr.-Noroozi-Vancouver-Implant-Specialist-.001.jpeg\" data-is-external-image=\"true\"  alt=\"Surrey Dental Implants\" width=\"80%\" height=\"auto\"></h2>\n<h2>The Procedure</h2>\n<p>Dental implant surgery is usually performed in stages. Sometimes, the tooth may be damaged and still in its place. In these cases the dentist might need to extract it separately before proceeding with the implant process.</p>\n<p>First, open the gum to reveal the bone. Each dental implant is then carefully placed in a socket that has been precisely drilled to the exact location of each tooth. After the implant site is inserted, the gum tissue around it is closed. The dental implant may be placed simultaneously with the removal of the tooth.</p>\n<p>If a dental implant has a screw-thread on its outer surface it can be screwed into position and if it does not, it is usually tapped into place.</p>\n<p>When installing a dental implant, the main goal is to make contact immediately with surrounding bone. This creates an initial stability, which over time is steadily enhanced by further growth of bone into microscopic grooves on the implant surface.</p>\n<p>Dental implants are designed to hold replacement teeth. They usually have an internal screw thread, or post space. This allows for a wide range of parts to fit.</p>\n<p>Once fitted, these components provide the foundation for long-term support of crowns, bridges or dentures.</p>\n<h2>Dental Implant Tooth Process</h2>\n<p>Dental implants are a long-lasting and safe way to replace your damaged or missing teeth. We'll help you decide if dental implants are right for you.</p>\n<p>Dental implant procedures are just one of the many dental services we offer our patients. There are many options for you if you suffer from a broken or missing tooth. You may need to replace just one tooth, or perhaps you need to replace several. Dentures are a completely different process. Your dentist can help you decide the best way to proceed.</p>\n<p>People can lose teeth in the following ways:</p>\n<ul>\n<li>Oral disease</li>\n<li>Teeth grinding</li>\n<li>Tooth decay</li>\n<li>Accidents</li>\n<li>Injury</li>\n</ul>\n<p>Call our dental office today and talk to one of our knowledgeable team members to see if you are a candidate for implants and to know the things you should know about dental implants. We can set up a consultation at which point your dentist will examine your teeth and your overall oral health to determine if this procedure is right for you.</p>\n<p>Here are some additional benefits of dental implants:</p>\n<ul>\n<li>Durability</li>\n<li>Maintenance low</li>\n<li>You will feel and look natural with your teeth</li>\n<li>Restore and boost your confidence</li>\n</ul>\n<p>If you think dental implants are the right choice for you, or if you have any questions, call and talk to one of our dentists today and let our implant dentist help restore your smile. Nothing is more important to us than the dental health and confident smiles of our patients!</p>\n<p>.</p>\n<h2><img loading=\"lazy\" src=\"https://www.thedentureclinic.co.uk/wp-content/uploads/2021/09/dental-implants-to-replace-several-missing-teeth.jpg\" data-is-external-image=\"true\"  alt=\"Surrey Dental Implants\" width=\"80%\" height=\"auto\"></h2>\n<h2>Is Implant Surgery Painful?</h2>\n<p>Implant patients find that the procedure is often easier than they expected. As with all dental treatments, you'll be conscious during the procedure and given local anesthesia. For more complex procedures, or at a patient's request, we can also provide conscious sedation, meaning a more comfortable experience for the patient.</p>\n<p>The surgery should be painless and you will not feel any discomfort.</p>\n<p>After the surgery is carried out you will experience some discomfort as the anesthetic wears off. You will receive post-operative medication depending on what type of surgery you had and the specific needs of your health. This medication is designed to keep you pain-free as well as low-risk of infection.</p>\n<p>If bone grafts are performed along with the implants there may be slightly more discomfort, but still only minor amounts.</p>\n<p>If you have any questions or worries before, during or after your treatment the team at Angel Care Dental are happy to help you.</p>\n<h2>What Is A Dental Implant?</h2>\n<p>Dental implants are artificial screws made of titanium or zirconium oxide that connect the jawbone and a dental restoration like a crown or denture. They are also called 'endosseous' implants or fixtures. They are an artificial tooth root. Implants are a replacement for natural teeth. Dental surgeons perform bone grafting procedures to hold the implant in place for patients who do not have enough surrounding bone structure, or graft bone to help connect implants to the maxillary sinuses on either side of the nose when placing dental implants in the upper jaw.</p>\n<h2><img loading=\"lazy\" src=\"http://dentaltourismohrid.com/images/implantabroad.gif\" data-is-external-image=\"true\"  alt=\"Surrey Dental Implants\" width=\"80%\" height=\"auto\"></h2>\n<h2>How Does Dental Implant Restoration Work?</h2>\n<p>Dental implants are an artificial tooth that looks natural and is made from metal or porcelain. The implant consists of two parts: a titanium screw attached to the jawbone, and a tooth-coloured Crown. Since dental implants are biocompatible and designed to fuse with bone, they offer a permanent solution that can last a lifetime with proper maintenance.</p>\n<p>Dental implants are not like dentures. They will stay in place and remain there. So, they do not impede speech in any way. Implants are a permanent part of the mouth and can be used to alleviate pain. Furthermore, dental implants do not require the reduction of any of your remaining teeth. They so closely resemble natural teeth that no one will ever know you've had restoration unless they do a dental exam.</p>\n<h2>What is the Lifespan of Dental Implants?</h2>\n<p>Provided you take good care of your dental implants, they can last a lifetime. Look after them by maintaining good oral hygiene, brushing, flossing and having regular check-ups with your dentist.</p>\n<h2><img loading=\"lazy\" src=\"https://mydentistnews.com/wp-content/uploads/2014/05/dental-implants-surrey.jpg\" data-is-external-image=\"true\"  alt=\"Surrey Dental Implants\" width=\"80%\" height=\"auto\"></h2>\n<h2>Why Do People Get Dental Implants?</h2>\n<p>There are certainly advantages to replace missing teeth with dental implants. The bone shrinks from lack of chewing, which causes the tooth to fall out. Dental implants help prevent bone shrinkage because they bring the chewing power back. Dental implants also prevent neighbouring teeth from moving toward the missing tooth spot, which can have a domino effect on the spacing of your teeth.</p>\n<p>Dental implants can also be a long-term option for dental care. Although they may cost more initially, long-term visits are usually less frequent with dental implants. Compared to bridges and crowns, implants wear down at a much slower rate.</p>\n<h2>How Long Does It Take?</h2>\n<ul>\n<li>Examination</li>\n</ul>\n<ul>\n<li>Examining</li>\n</ul>\n<p>You will be subject to a comprehensive oral exam during your appointment. We will require a 3D X-ray called a Cone Beam Computed Tomography (CBCT) scan. It provides precise information about the amount of bone available as well as its proximity to any other important structures, like nerves or blood vessels. If teeth have to be removed, then we normally wait 6-12 weeks before placing the implant, although there are a few cases where we can place the crown immediately after the tooth has been removed.</p>\n<ul>\n<li>Operative Procedure</li>\n</ul>\n<ul>\n<li>Operative Procedure</li>\n</ul>\n<ul>\n<li>Recovery</li>\n</ul>\n<ul>\n<li>Recovery</li>\n</ul>\n<p>You may feel some discomfort after the anesthetic has worn off. You will be given specific instruction on what medication to take and how to look after the surgical site. Implants will fuse with surrounding bone and become one (osseointegration). The time taken for this process to occur depends on the healing capabilities of the individual and if any bone grafting was carried out. Integration can take as long as 3 months in simple cases, while it may take 9 months to integrate grafted cases.</p>\n<ul>\n<li>Installation of the crown</li>\n</ul>\n<ul>\n<li>Installation of the crown</li>\n</ul>\n<p>After the implant is fused to the bone, you'll need to visit your dentist again. At this time, the dentist will make an impression and fabricate a customized porcelain crown. The crown will be cemented or screwed to the implant, complete the restoration.</p>\n<p>Angel Care Dental has the most up-to-date equipment, including microscopes and soft tissue lasers. We only use the finest implant components made by the most respected manufacturers around the globe. Over 250 implant companies offer thousands of implant designs. Many attempt to copy the designs of more successful and established implant companies. We partner with the market leaders who are Nobel Biocare and Noess.</p>\n<h2><img loading=\"lazy\" src=\"https://d2zp5xs5cp8zlg.cloudfront.net/image-30069-400.jpg\" data-is-external-image=\"true\"  alt=\"Surrey Dental Implants\" width=\"80%\" height=\"auto\"></h2>\n<h2>Why Dental Implants?</h2>\n<p>Implants are better than partial or bridge dentures. To bridge one space, why compromise the healthy structure of nearby teeth? In addition, removing a partial denture at night or after meals may be inconvenient and cause food trapping between other teeth. The jawbone begins to degrade when teeth become missing. Dental implants prevent the bone from separating, which gives the implant a more attractive appearance as well as a significant improvement in chewing ability.</p>\n<p>Implants can be used for a single tooth or multiple missing teeth, as well as the whole dental arch. Implant-supported dentures can replace conventional dentures that aren't fitting properly due to a lack of jawbone.</p>\n<h2>Who Is Suitable For Dental Implant Treatment?</h2>\n<p>Adults of all ages are eligible for dental implants provided they are in good physical condition and their gums are healthy. We always carry out a thorough consultation first to determine if it is safe to go ahead with the treatment.</p>\n<h2><img loading=\"lazy\" src=\"https://thegentledental.co.uk/wp-content/uploads/2021/10/implant-clinic-surrey.png\" data-is-external-image=\"true\"  alt=\"Surrey Dental Implants\" width=\"80%\" height=\"auto\"></h2>\n<h2>Dental Implant Restoration</h2>\n<p>If you are looking to have missing teeth replaced, you may want to consider our dental implant restoration services.</p>\n<h2>What Are Dental Implants?</h2>\n<p>Dental implant surgery is a procedure that replaces tooth roots with metal, screw like posts and replaces damaged or missing teeth with artificial teeth that look and function much like real ones.</p>\n<h2><img loading=\"lazy\" src=\"https://i.ytimg.com/vi/-b6fNgnfrIs/maxresdefault.jpg\" data-is-external-image=\"true\"  alt=\"Surrey Dental Implants\" width=\"80%\" height=\"auto\"></h2>\n<h2>What Are The Alternatives To Dental Implants?</h2>\n<p>A bridge: Like an implant, a bridge is a fixed option. Bridges use the space on either side of a gap to replace a missing tooth. They are not suitable for large spans and unfortunately require the preparation of healthy teeth to support the missing tooth. They also do not last as long as implants, on average 15 years. At this point it is likely the supporting teeth will also be compromised, resulting in an even larger gap.</p>\n<h2>The Integration Period</h2>\n<p>There is a waiting period of about 3 and 5 months for the implant and the bone to knit together. This is called the Integration period. During this time any gap that you have in your mouth will have a temporary bridge or a denture to fill the space if required.</p>\n<h2><img loading=\"lazy\" src=\"https://cuspdental.ca/wp-content/uploads/2019/11/implant.jpg\" data-is-external-image=\"true\"  alt=\"Surrey Dental Implants\" width=\"80%\" height=\"auto\"></h2>\n<h2>Benefits Of Dental Implants</h2>\n<p>There are many expected (and unexpected) benefits of dental implants, including:</p>\n<p>Even better, implants can be more comfortable and durable than traditional dentures.</p>\n<h2>How Do I Prepare For My Dental Implant Procedure?</h2>\n<p>To discuss your entire procedure, Angel Care Dental should conduct a thorough dental exam. Ask questions like how long the procedure will take. Or, how about recovery time and care of replacement tooth? Angel Care Dental will be more than happy to answer all your questions.</p>\n<h2><img loading=\"lazy\" src=\"https://d2wvwvig0d1mx7.cloudfront.net/data/org/16615/media/img/cache/1128x0/1840661_1128x0.jpg\" data-is-external-image=\"true\"  alt=\"Surrey Dental Implants\" width=\"80%\" height=\"auto\"></h2>\n<h2>How do Implants Need to Be Maintained?</h2>\n<p>Implants should be treated just like natural teeth. Even though they can replace your tooth, they still have the potential to infect. Implant loss can result from infection of bone surrounding the implant.</p>\n<p>Our team will guide you on the best ways to care for your implants and natural teeth so that you have a beautiful smile that lasts many years. Make an appointment now.</p>\n<h2>What Do Dental Implants Look Like?</h2>\n<p>Dental implants will look exactly like your natural teeth. The dental implant is not visible as it is integrated into the jawbone. The prosthesis (crown) that attaches to the implant is made to match the look and function of your neighbouring teeth.</p>\n<h2><img loading=\"lazy\" src=\"https://surreydentalimplants.co.uk/wp-content/uploads/2021/12/pav-khaira-dental-implants-surrey-415x498.jpg\" data-is-external-image=\"true\"  alt=\"Surrey Dental Implants\" width=\"80%\" height=\"auto\"></h2>\n<h2>More About Dental Implants</h2>\n<p>Implants can do much more than fill gaps. They also improve your teeth's function. Large spaces between teeth can lead to an increase in bacteria and plaque, not to mention an increase in embarrassment and shame.</p>\n<p>Implants for dental purposes are:</p>\n<ul>\n<li>Durable</li>\n<li>Permanent</li>\n<li>Natural-Looking</li>\n<li>Dentures are a great alternative to dentures</li>\n</ul>\n<p>Implants for dental care look natural. They will allow you to smile, talk and eat with confidence.</p>",
            "author": {
                "name": "Dentist"
            },
            "tags": [
            ],
            "date_published": "2022-06-22T20:54:43-07:00",
            "date_modified": "2022-06-27T06:53:43-07:00"
        }
    ]
}
